КонКонф/Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроданныйТовар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товар</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

КонКонф/Documents/Продажа/Forms/ФормаДокумента1/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроданныйТоварНаименованиеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	
	ТекСтрока = Элементы.ПроданныйТовар.ТекущиеДанные;
	ТекСтрока.Цена = ВозвратЦены(ТекСтрока.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроданныйТоварКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика
	
	ТекСтрока = Элементы.ПроданныйТовар.ТекущиеДанные;
	ИзменениеКоличества(ТекСтрока.Наименование, ТекСтрока.Количество);
	ТекСтрока.Цена = ВозвратЦены(ТекСтрока.Наименование);
	ТекСтрока.Стоимость = ТекСтрока.Количество * ТекСтрока.Цена;
	
КонецПроцедуры

&НаСервере
Функция ВозвратЦены(Значение)
	Ссылка = Справочники.Товар.НайтиПоНаименованию(Значение);
	Товар = Ссылка.ПолучитьОбъект();
	Возврат Товар.Цена;
КонецФункции

Функция ИзменениеКоличества(Название, Значение)
	Ссылка = Справочники.Товар.НайтиПоНаименованию(Название);
	Товар = Ссылка.ПолучитьОбъект();	
	//Возврат Товар.Количество;
	Если Товар.Количество >= Значение Тогда
		Разность = Товар.Количество - Значение;
		Товар.Количество = Разность;
		Если Товар.Количество = 0 Тогда 
			Товар.Доступность = Перечисления.ДоступностьТовара.Отсутствует;
		КонецЕсли;
		Товар.Записать();
	Иначе 
		Если Товар.Количество = 0 Тогда 
			Сообщить("Товар отсутствует!");
		Иначе
			Сообщить("На складе нет токого количество товара!");
		КонецЕсли;
	КонецЕсли;	
КонецФункции
